In [3]:
library(DBI)
con <- dbConnect(odbc::odbc(), DSN="College;Trusted_Connection=yes;")

In [8]:
students <- dbReadTable(con, "students")
teachers <- dbReadTable(con, "teachers")
classroom <- dbReadTable(con, "classroom")
courses <- dbReadTable(con, "courses")
departments <- dbReadTable(con, "departments")

In [5]:
head(students)

  Student_id First_name Last_name Gender
1 162         Elmira    Holston   F
2 154         Sierra    Van Vorst F
3  28         Mycah     Bingham   F
4  54         Alia      Jones     F
5  31         Chanda    Fillmore  F
6 272         Jennifer  Smith     F

In [6]:
library(dplyr)

Attaching package: 'dplyr'


The following objects are masked from 'package:stats':

    filter, lag


The following objects are masked from 'package:base':

    intersect, setdiff, setequal, union

In [9]:
Sum_student_by_depart <- (classroom %>% 
                            left_join(courses, by = "Course_id") %>%  ##### joining courses + classroom 
                            left_join(departments, by = "Department_id")) %>%   ##### joining courses + classroom + departments
  group_by(Department_id, Department_name) %>%   ##### grouping and counting  the sum students by departments
  summarise(sum_student=n_distinct(Student_id))

In [10]:
Sum_student_by_depart

  Department_id Department_name sum_student
1 1             English          84
2 2             Science         200
3 3             Arts            137
4 4             Sport            81